In [1]:
# import our pakages

In [2]:
import numpy as np
import pandas as pd

In [ ]:
# lets create a distionary

In [4]:
#np.nan gives us the null value
dict1={'Names':[np.nan,'pavan','raghu','gopi'],'Age':[21,np.nan,22,34],'qualification':['b.tech','mtech',np.nan,'school']}

In [7]:
df=pd.DataFrame(dict1)
df

   Names   Age qualification
0    NaN  21.0        b.tech
1  pavan   NaN         mtech
2  raghu  22.0           NaN
3   gopi  34.0        school

In [9]:
df.isnull().sum()
#true == null value

Names            1
Age              1
qualification    1
dtype: int64

In [10]:
# now

In [11]:
dict2={'Names':[None,'pavan','raghu','gopi'],'Age':[21,None,22,34],'qualification':['b.tech','mtech',None,'school']}

In [12]:
df=pd.DataFrame(dict2)

In [13]:
df

   Names   Age qualification
0   None  21.0        b.tech
1  pavan   NaN         mtech
2  raghu  22.0          None
3   gopi  34.0        school

**NOTE**:None only works for categorical data for numberical data it works at nan only

In [15]:
df.isnull().sum()

Names            1
Age              1
qualification    1
dtype: int64

In [16]:
#now dist-3
dict3={'Names':['None','pavan','raghu','gopi'],'Age':[21,'None',22,34],'qualification':['b.tech','mtech','None','school']}

In [17]:
df=pd.DataFrame(dict3)

In [18]:
df

   Names   Age qualification
0   None    21        b.tech
1  pavan  None         mtech
2  raghu    22          None
3   gopi    34        school

**NOTE:** Here strings will work as string only

# how to overcome missimg values

- Method-1

- FILLING WITH RANDOM NUMBER 
- DATAFRAME_NAME=DF
- METHOD_NAME= Fillna()

In [22]:
dict1={'Names':[np.nan,'pavan','raghu','gopi'],'Age':[21,np.nan,22,34],'qualification':['b.tech','mtech',np.nan,'school']}

In [24]:
df=pd.DataFrame(dict1)

In [28]:
df.fillna(20)
#our entire data is filled with 20

   Names   Age qualification
0     20  21.0        b.tech
1  pavan  20.0         mtech
2  raghu  22.0            20
3   gopi  34.0        school

In [27]:
df

   Names   Age qualification
0    NaN  21.0        b.tech
1  pavan   NaN         mtech
2  raghu  22.0           NaN
3   gopi  34.0        school

In [29]:
# if inplace=True then ?
df.fillna(20,inplace=True)
#inplace will over ride our null values and places our values

In [30]:
df

   Names   Age qualification
0     20  21.0        b.tech
1  pavan  20.0         mtech
2  raghu  22.0            20
3   gopi  34.0        school

# Method-2
- Filling missing value with a random number in specific column

In [ ]:
dict1={'Names':[np.nan,'pavan','raghu','gopi'],'Age':[21,np.nan,22,34],'qualification':['b.tech','mtech',np.nan,'school']}

In [31]:
df=pd.DataFrame(dict1)

In [38]:
df['Names']=df['Names'].fillna('dhoni')

In [36]:
df

   Names   Age qualification
0  dhoni  21.0        b.tech
1  pavan   NaN         mtech
2  raghu  22.0           NaN
3   gopi  34.0        school

# Method-3

- we have some methods as 
  - bfill
  - ffill
  - backfill
  - pad

**NOTE**: THUS METHODS CAN BE AXCESSED BY ONLY (FILLNA) METHOD

In [40]:
#readdata again
dict1={'Names':[np.nan,'pavan','raghu','gopi'],'Age':[21,np.nan,22,34],'qualification':['b.tech','mtech',np.nan,'school']}
df=pd.DataFrame(dict1)
df

   Names   Age qualification
0    NaN  21.0        b.tech
1  pavan   NaN         mtech
2  raghu  22.0           NaN
3   gopi  34.0        school

- bfill

In [42]:
#here we have method= attribute inside the fillna .their use our method
df.fillna(method='bfill')
# here our back side data will be filled at that null places

   Names   Age qualification
0  pavan  21.0        b.tech
1  pavan  22.0         mtech
2  raghu  22.0        school
3   gopi  34.0        school

In [ ]:
# here our names index=0 is null,age index=1 is null, qualification index-2 is null thus are filled with backside data

- ffill

In [44]:
df.fillna(method='ffill')
# it is also similar with bfill 
# but here it is filled with frontside values

   Names   Age qualification
0    NaN  21.0        b.tech
1  pavan  21.0         mtech
2  raghu  22.0         mtech
3   gopi  34.0        school

- Backfill

In [48]:
df.fillna(method='backfill',inplace=True)
# it is same as bfill

In [50]:
df

   Names   Age qualification
0  pavan  21.0        b.tech
1  pavan  22.0         mtech
2  raghu  22.0        school
3   gopi  34.0        school

**NOTE:** BACKFILL==BFILL

# Method-4

- MEAN 
- MEDAIN 
- MODE

- as we know that mean,median,mode works with numerical columns only
- here instide of filling with a random number we replace by mean,medain values

In [53]:
# take the colum
dict1={'Names':[np.nan,'pavan','raghu','gopi'],'Age':[21,np.nan,22,34],'qualification':['b.tech','mtech',np.nan,'school']}

In [55]:
df=pd.DataFrame(dict1)

In [59]:
age_mean=df['Age'].mean()
age_mean

25.666666666666668

In [63]:
# now replace thus by method fiilna
op=df['Age'].fillna(age_mean)
op

0    21.000000
1    25.666667
2    22.000000
3    34.000000
Name: Age, dtype: float64

- Median

In [67]:
age_medain=df['Age'].median()
age_medain

22.0

In [69]:
# now replace thus by method called as fillna
df['Age'].fillna(age_medain)

0    21.0
1    22.0
2    22.0
3    34.0
Name: Age, dtype: float64

# Method-5

- KNNImuper
- which imputes the value

- KNN is k neariest neighoubers

- IN this method inside of take mean of all values 
- knn will take the mean of surrouding neariest neighoubers &
- fill the nan value with that value

In [70]:
# it is in sklearn package

In [85]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)#n_neighbors=5 meaning is how many neighors u want to mean bydefault =5

In [86]:
knn.fit_transform(df[['Age']])

array([[21.        ],
       [25.66666667],
       [22.        ],
       [34.        ]])

In [87]:
df

   Names   Age qualification
0    NaN  21.0        b.tech
1  pavan   NaN         mtech
2  raghu  22.0           NaN
3   gopi  34.0        school